Revit 2027 API
ParameterTypeId.AssemblyPrecastFreeze Property
 "Disable Precast Updates"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AssemblyPrecastFreeze { get; }
Public Shared ReadOnly Property AssemblyPrecastFreeze As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AssemblyPrecastFreeze {
	ForgeTypeId^ get ();
}
static member AssemblyPrecastFreeze : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace